Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Sets the state of the tray icon.
fr: Définit l'état de l'icône de la zone de notification.

source: (Re)Sets the tooltip text for the tray icon.
fr: (Re)Définit le texte de l'info-bulle pour l'icône de la zone de notification.

source: Displays a balloon tip from the AutoIt Icon.
fr: Affiche une info-bulle 'balloon' depuis l'icône du script AutoIt.

source: If equal -1 it will be added 'behind' the last created item (default setting).
fr: Si égal à -1, il sera ajouté 'derrière' le dernier item créé (réglage par défaut).

source: If equal -1 it will be added 'behind' the last created entry (default setting).
fr: Si égal à -1, il sera ajouté 'derrière' la dernière entrée créée ( réglage par défaut).

source: 0 (default) = create a normal menuitem, 1 = create a menuradioitem.
fr: 0 (par défaut) = crée un menuitem normal, 1 = crée un 'menuradioitem'.

source: the identifier (controlID) of the new tray menuitem.
fr: Retourne l'identifiant (controlID) du nouveau menuitem de la zone de notification.

source: If the 'text' parameter is an empty string ( "" ) then a separator line is created.
fr: Si le paramètre 'text' est une chaîne vide ( "" ), alors une ligne de séparation est créée.

source: By default, normal checked menuitems (not radio menuitems) will be automatically unchecked if you click it!
fr: Par défaut, un item de menu coché (pas un item de menu radio) sera automatiquement décoché si vous cliquez dessus!

source: To turn off this behaviour use the value '2' in TrayMenuMode.
fr: Pour désactiver ce comportement en utilisez la valeur '2' dans TrayMenuMode.

source: Radio menuitems are automatically grouped together and these groups are separated by a separator line or a normal item which is not a radio item.
fr: Les items de menu radio sont automatiquement regroupés et ces groupes sont séparés par une ligne de séparation ou un item normal, qui n'est pas un item radio.

source: By default, a clicked radio menuitem will be checked automatically and all other radio items in the same group will be unchecked!
fr: Par défaut, un item de menu radio cliqué sera automatiquement coché et tous les autres items radio du même groupe seront décochés!

source: To turn off this behaviour use the value '8' in TrayMenuMode.
fr: Pour désactiver ce comportement en utilisez la valeur '8' dans TrayMenuMode .

source: Required for the $TRAY_CHECKED and $TRAY_ICONSTATE_SHOW constants.
fr: Nécessaire pour les constantes TRAY_CHECKED $et $TRAY_ICONSTATE_SHOW constantes.

source: The default tray menu items will not be shown and items are not checked when selected.
fr: Les items du menu par défaut de la zone de notification ne seront pas affichés et ils ne seront pas cochés lorsqu'il seront sélectionnés.

source: These are options 1 and 2 for TrayMenuMode.
fr: Ce sont les options 1 et 2 de TrayMenuMode.

source: Create a tray item with the radio item parameter selected.
fr: Crée un item de la zone de notification avec le paramètre radio sélectionné.

source: Create a separator line.
fr: Crée une ligne de séparation.

source: Show the tray menu.
fr: Affiche le menu de la zone de notification.

source: Display a message box about the AutoIt version and installation path of the AutoIt executable.
fr: Affiche une boîte de message à propos de la version et du chemin d'installation de l'exécutable AutoIt AutoIt.

source: Find the folder of a full path.
fr: Trouve le dossier d'un chemin d'accès complet.

source: Exit the loop.
fr: Sort de la boucle.

source: The sub/menu text.
fr: Le texte menu ou du sous-menu.

source: Default -1 (refers to first level menu).
fr: Par défaut, -1 (se réfère au premier niveau du menu).

source: Default -1 (at the bottom).
fr: Par défaut -1 (en bas).

source: the identifier (controlID) of the new tray menu.
fr: Retourne l'identifiant (controlID) du nouveau menu de la zone de notification.

source: Required for the $TRAY_ICONSTATE_SHOW constant.
fr: Nécessaire pour la constante $TRAY_ICONSTATE_SHOW.

source: Create a tray menu sub menu with two sub items.
fr: Crée un sous-menu du menu de la zone de notification avec deux sous-items.

source: Returns an event.
fr: Retourne un événement.

source: The "event" returned is the control ID of the control sending the message, or it is a special event (like the mouse clicking on the tray icon).
fr: L'événement retourné est l'ID du contrôle qui a envoyé le message, ou il s'agit d'un événement spécial (comme le clic de la souris sur l'icône de la zone de notification).

source: Event IDs
fr: IDs d'événements

source: the primary mouse button was pressed
fr: le bouton principal de la souris a été pressé

source: the primary mouse button was released
fr: le bouton principal de la souris a été relâché

source: the secondary mouse button was pressed
fr: le bouton secondaire (droit) de la souris a été pressé

source: the secondary mouse button was released
fr: le bouton secondaire (droit) de la souris a été relâché

source: the primary mouse button was double pressed
fr: le bouton principal de la souris a été pressé deux fois

source: the secondary mouse button was double pressed
fr: le bouton secondaire (droit) de la souris a été pressé deux fois

source: The above constants are defined in #include <TrayConstants.au3>
fr: Les constantes ci-dessus sont définies dans TrayConstants.au3

source: The control identifier (controlID) as returned by a TrayCreateItem or TrayCreateMenu function.
fr: L'identifiant du contrôle (controlID) tel que retourné par la fonction TrayCreateItem ou TrayCreateMenu.

source: Display a message box to ask whether or not to delete the 'Delete' item.
fr: Affiche une boîte de message pour demander si oui ou non il faut supprimer l'item 'Delete'.

source: If the return value of MsgBox is equal to $IDYES then delete the item.
fr: Si la valeur de retour de MsgBox est égale à $IDYES alors supprime l'item.

source: Delete the tray menu item.
fr: Supprimer l'élément de menu de la barre.

source: To get the handle to the tray context menu itself use '0' as controlID.
fr: Pour obtenir Le handle dans le menu contextuel de la zone de notification lui-même, utilisez '0' comme controlID.

source: Constants required for SetMenuColor
fr: Constantes nécessaires pour SetMenuColor

source: BGR color value, '0' refers to the tray menu itself.
fr: Valeur de couleur RGB, '0' se réfère au menu de la zone de notification elle-même.

source: BGR color value for the 'Settings' menu.
fr: Valeur de couleur RGB pour le menu "Settings".

source: Get the internal menu handle
fr: Obtient le handle de menu interne

source: Returns the state.
fr: Retourne l'état.

source: See TrayItemSetState table for values.
fr: Consultez Table TrayItemSetState pour les différentes valeurs.

source: Display a message box about the state of the 'About' item.
fr: Affiche une boîte de message sur l'état de l'item 'About'.

source: The itemtext of the tray menu/item control.
fr: Retourne le texte du contrôle menu ou item de la zone de notification.

source: Display a message box about the text of the 'About' item.
fr: Affiche une boîte de message sur le texte de l'item 'About'.

source: The item identifier (itemID) as returned by a TrayCreateItem function.
fr: L'identifiant de l'item (itemID) tel que retourné par la fonction TrayCreateItem.

source: 1 = the "function" is not defined.
fr: 1 = la "fonction" n'est pas définie.

source: OnEvent functions are only called when the option TrayOnEventMode is set to 1 - when in this mode TrayGetMsg() is NOT used at all.
fr: Les fonctions OnEvent sont appelées lorsque l'option TrayOnEventMode est réglé sur 1 - Dans ce mode, TrayGetMsg() n'est PAS utilisée du tout.

source: Within the called user function the item identifier can be retrieved with @TRAY_ID.
fr: Dans la fonction utilisateur appelée l'identifiant de l'item peut être récupéré avec TRAY_ID.

source: Enable TrayOnEventMode.
fr: Active TrayOnEventMode.

source: Display the About MsgBox when the tray icon is double clicked on with the primary mouse button.
fr: Affiche la MsgBox Aboutlorsque l'icône de la zone de notification est double-cliquée par le bouton principal de la souris.

source: An idle loop.
fr: Une boucle d'inactivité.

source: Menuitem will be checked
fr: L'item du menu sera coché

source: Menuitem will be unchecked
fr: L'item du menu sera décoché

source: Menuitem will be enabled
fr: L'item du menu sera activé

source: Menuitem will be greyed out
fr: L'item du menu sera grisé

source: Menuitem will be selected
fr: L'item du menu sera sélectionné

source: Menuitem will be set as default menuitem
fr: L'item du menu sera défini comme l'item par défaut

source: State values can be summed up as for example $TRAY_CHECKED + $TRAY_DEFAULT sets the menuitem in an checked and default state.
fr: Les valeurs de l'État peuvent s'ajouter comme par exemple $TRAY_CHECKED + $TRAY_DEFAULT qui définit l'item du menu dans l'état coché et par défaut.

source: To reset/delete the $TRAY_DEFAULT-state for a menuitem just use this function on the item with another state, for instance with $TRAY_ENABLE.
fr: Pour réinitialiser ou effacer l'état $TRAY_DEFAULT pour un item de menu il suffit d'utiliser cette fonction sur l'item avec un autre état, par exemple avec $TRAY_ENABLE.

source: When you set $TRAY_DEFAULT state for a menuitem, the default behavior of primary double click on tray icon is to execute this default menuitem.
fr: Lorsque vous définissez l'état $TRAY_DEFAULT pour un item de menu, le comportement par défaut d'un double-clic gauche sur l'icône de la zone de notification est d'exécuter cet item par défaut.

source: To disable this behavior use flag 4 as the option in TrayMenuMode.
fr: Pour désactiver ce comportement utilisez le flag 4 pour option de TrayMenuMode.

source: Set the 'About' item state to checked.
fr: Définit l'état de l'item 'About' à coché.

source: The new text of the tray menu/item control.
fr: Le nouveau texte du contrôle menu ou item de menu de la zone de notification.

source: To change the itemtext of the default menuitems (Script Paused/Exit) use the constants $TRAY_ITEM_EXIT and $TRAY_ITEM_PAUSE as controlID.
fr: Pour changer le texte des items de menu par défaut (script en Pause ou Exit), utilisez les constantes $TRAY_ITEM_EXIT et $TRAY_ITEM_PAUSE comme controlID.

source: Required for the $TRAY_ICONSTATE_SHOW, $TRAY_ITEM_EXIT and $TRAY_ITEM_PAUSE constants.
fr: Nécessaire pour les constantes $TRAY_ICONSTATE_SHOW, $TRAY_ITEM_EXIT et $TRAY_ITEM_PAUSE.

source: The script will not pause when selecting the tray icon.
fr: Le script ne sera pas une pause lors de la sélection de l'icône de la zone de notification.

source: Items are not checked when selected.
fr: Les items ne sont pas cochés lorsqu'ils sont sélectionnés.

source: Select this item to change the text with a random number.
fr: Sélectionne cette option pour modifier le texte avec un nombre aléatoire.

source: Set the text of the default 'Exit' item.
fr: Définit le texte de l'item par défaut 'Exit'.

source: Set the text of the default 'Pause' item.
fr: Définit le texte de l'item par défaut 'Pause'.

source: Set the text of the 'Random' item with a random integer.
fr: Définit le texte de l'item 'Random' avec un nombre aléatoire.

source: 0 = Tray menu will never be shown through a mouseclick
fr: 0 = Le menu de la zone de notification ne sera jamais affiché par un clic de souris

source: 1 = Pressing primary mouse button
fr: 1 = En appuyant sur le bouton principal (gauche) de la souris

source: 2 = Releasing primary mouse button
fr: 2 = En relâchant le bouton principal de la souris

source: 4 = Double-click primary mouse button
fr: 4 = En double-cliquant sur le bouton principal de la souris

source: 8 = Pressing secondary mouse button
fr: 8 = En appuyant sur le bouton secondaire (droit) de la souris

source: 16 = Releasing secondary mouse button
fr: 16 = En relâchant le bouton secondaire de la souris

source: 32 = Double-click secondary mouse button
fr: 32 = En double-cliquant sur le bouton secondaire de la souris

source: 64 = Hovering over the tray icon
fr: 64 = En survolant l'icône

source: These flags are NOT tray event values!
fr: Ces indicateurs ne sont PAS des valeurs d'événement de la zone de notification!

source: Default value is "9" - pressing the primary or secondary mouse button will show the tray menu.
fr: La valeur par défaut est "9" - en appuyant sur le bouton principal ou secondaire de la souris vous affichez le menu.

source: Show the tray menu when the mouse if hovered over the tray icon.
fr: Affiche le menu de la zone de notification lorsque la souris survole l'icône.

source: The filename of the icon to be display in the tray.
fr: Le nom de l'icône à afficher dans la zone de notification.

source: Icon identifier if the file contains multiple icons.
fr: Identifiant de l'icône si le fichier contient plusieurs icônes.

source: To reset the icon to the default, use the function with no parameters:
fr: Pour réinitialiser l'icône par défaut, utilisez la fonction sans paramètre:

source: The filename parameter can be set to "blank", "info", "question", "stop" or "warning" to select some corresponding standard icon.
fr: Le paramètre filename peut être "blank", "info", "question", "stop" ou "warning" afin de sélectionner l'icône standard correspondante.

source: Find the difference in time from the previous call of TimerInit
fr: Trouve la différence de temps avec l'appel précédent de TimerInit

source: If the difference is greater than 1 second then change the tray menu icon.
fr: Si la différence est supérieure à 1 seconde, alors change l'icône du menu de la zone de notification.

source: Use a negative number for ordinal numbering.
fr: Utilise un nombre négatif pour la numérotation ordinale.

source: Set the tray menu tooltip with information about the icon index.
fr: Définit l'info-bulle du menu avec des informations sur l'indice de l'icône.

source: Set the tray menu icon using the shell32.dll and the random index number.
fr: Définit l'icône du menu de la barre à l'aide de shell32.dll et le numéro d'index aléatoire.

source: Reset the timer.
fr: Réinitialise le compteur.

source: The tray icon will be shown.
fr: L'icône de la zone de notification sera affiché.

source: The tray icon will be hidden.
fr: L'icône de la zone de notification sera caché.

source: The user turned the tray icon flashing on.
fr: L'utilisateur fait flasher l'icône de la .

source: The user turned the tray icon flashing off.
fr: L'utilisateur arrête de faire flasher l'icône de la zone de notification.

source: The primary mouse button was pressed on the tray icon.
fr: Le bouton principal de la souris a été appuyé sur l'icône de la zone de notification.

source: The primary mouse button was released on the tray icon.
fr: Le bouton principal de la souris a été relaché sur l'icône de la zone de notification.

source: The secondary mouse button was pressed on the tray icon.
fr: Le bouton secondaire (droit) de la souris a été appuyé sur l'icône de la zone de notification.

source: The secondary mouse button was released on the tray icon.
fr: Le bouton secondaire de la souris a été relaché sur l'icône de la zone de notification.

source: The mouse moves over the tray icon.
fr: La souris passe au dessus de l'icône de la zone de notification.

source: The primary mouse button was double pressed on the tray icon.
fr: Le bouton principal de la souris a été appuyé deux fois sur l'icône de la zone de notification.

source: The secondary mouse button was double pressed on the tray icon.
fr: Le bouton secondaire de la souris a été appuyé deux fois sur l'icône de la zone de notification.

source: Required for the $TRAY_EVENT_PRIMARYDOUBLE, $TRAY_EVENT_SECONDARYUP and $TRAY_ICONSTATE_SHOW constants.
fr: Nécessaire pour les constantes $TRAY_EVENT_PRIMARYDOUBLE, $TRAY_EVENT_SECONDARYUP et $TRAY_ICONSTATE_SHOW.

source: Check the last tray item identifier.
fr: Teste le dernier identifiant de l'item.

source: The filename of the icon to be display as pause icon in the tray.
fr: Le nom de l'icône à afficher dans la zone de notification.

source: To reset the pause icon to the default (red cross), use the function with no parameters:
fr: Pour réinitialiser l'icône pause à l'icône par défaut (croix rouge), utilisez la fonction sans paramètre:

source: Set the pause icon.
fr: Définit l'icône pause.

source: This will flash on and off when the tray menu is selected and the script is paused.
fr: Elle clignotera lorsque le menu de la barre est sélectionné et le script sera en pause.

source: $TRAY_ICONSTATE_SHOW (1) = Shows the tray icon (default)
fr: $TRAY_ICONSTATE_SHOW (1) = Affiche l'icône de la zone de notification (option par défaut)

source: $TRAY_ICONSTATE_HIDE (2) = Destroys/Hides the tray icon
fr: $TRAY_ICONSTATE_HIDE (2) = Détruit/Cache l'icône de la zone de notification

source: $TRAY_ICONSTATE_FLASH (4) = Flashes the tray icon
fr: $TRAY_ICONSTATE_FLASH (4) = Fait clignoter l'icône dans la zone de notification

source: $TRAY_ICONSTATE_STOPFLASH (8) = Stops tray icon flashing
fr: $TRAY_ICONSTATE_STOPFLASH (8) = Arrête de faire clignoter l'icône dans la zone de notification

source: $TRAY_ICONSTATE_RESET (16) = Resets the icon to the defaults (no flashing, default tip text)
fr: $TRAY_ICONSTATE_RESET (16) = Ré-initialise l'icône aux valeurs par défaut (pas de clignotement, texte par défaut)

source: Constants are defined in TrayConstants.au3
fr: Les constantes sont définis dans TrayConstants.au3

source: This function overrides the "TrayIconHide"-option and "#NoTrayIcon"-setting.
fr: Cette fonction remplace l'option "TrayIconHide" et le paramètre "#NoTrayIcon".

source: The normal and pause tray icon are NOT reset by this function!
fr: Les icônes normal et pause de la zone de notification ne sont PAS réinitialisées par cette fonction!

source: Start flashing the tray icon.
fr: Clignoter l'icône de la barre.

source: Wait for 5 seconds.
fr: Attendez 5 secondes.

source: Stop flashing the tray icon.
fr: Arrête le clignotement de l'icône.

source: The new text to be displayed as tooltip.
fr: Le nouveau texte qui doit être affiché comme info-bulle.

source: The length is limited - see Remarks.
fr: La longueur est limitée - Voir Remarques.

source: The tooltip length is limited to 128 characters.
fr: La longueur de l'info-bulle est limitée à 128 caractères.

source: To reset the tooltip to the default text, use the function with no parameters:
fr: Pour réinitialiser l'info-bulle avec le texte par défaut, utilisez la fonction sans paramètre:

source: The tooltip text is only changed when the tray icon is visible!
fr: Le texte de l'info-bulle n'est modifié que lorsque l'icône est visible!

source: The tray menu icon must be shown before we can set some text.
fr: L'icône du menu de la barre doit être affichée avant que nous puissions mettre un peu de texte.

source: Text appears in bold at the top of the balloon tip.
fr: Le texte qui apparait en gras en haut de l'info-bulle 'balloon'.

source: (63 characters maximum)
fr: (63 caractères maximum)

source: Message the balloon tip will display.
fr: Message qui sera affiché par l'info-bulle 'balloon'.

source: (255 characters maximum)
fr: (255 caractères maximum)

source: A rough estimate of the time (in seconds) the balloon tip should be displayed.
fr: Une estimation approximative du temps (en secondes) d'affichage de l'info-bulle balloon.

source: (Windows has a min and max of about 10-30 seconds but does not always honor a time in that range.)
fr: (Windows a un mini/maxi d'environ 10-30 secondes, mais ne le respecte pas toujours.)

source: $TIP_ICONNONE (0) = No icon (default)
fr: $TIP_ICONNONE (0) = Pas d'icône (défault)

source: $TIP_ICONASTERISK (1) = Info icon
fr: $TIP_ICONASTERISK (1) = Icône Information

source: $TIP_ICONEXCLAMATION (2) = Warning icon
fr: $TIP_ICONEXCLAMATION (2) = Icône Warning

source: $TIP_ICONHAND (3) = Error icon
fr: $TIP_ICONHAND (3) = Icône Error

source: $TIP_NOSOUND (16) = Disable sound
fr: $TIP_NOSOUND (16) = Coupe le son

source: A Tray tip will close if the AutoIt tray icon disappears.
fr: L'info-bulle se fermera si l'icône du script AutoIt disparaît.

source: Consequently, the TrayTip() may not appear if AutoItSetOption("TrayIconHide", 1) is set or if the user has disabled balloon tips via registry settings!
fr: En conséquence, TrayTip() peut ne pas apparaître si AutoItSetOption("TrayIconHide", 1) est utilisé ou si l'utilisateur a désactivé les info-bulles balloon via les paramètres du registre!

source: Windows XP usually plays a sound when displaying a balloon tip.
fr: Windows XP joue habituellement un son lors de l'affichage d'une info-bulle.

source: This sound can be disabled by adding $TIP_NOSOUND to the option parameter or by setting an empty title.
fr: Ce son peut être désactivé en ajoutant $TIP_NOSOUND au paramètre option ou en utilisant un titre vide.

source: To clear a balloon tip that is being displayed, call another tip with an empty text string (and any title).
fr: Pour effacer une info-bulle affiché, appelez en une autre avec une chaîne de texte vide (et n'importe quel titre).

source: Returns the size of array dimensions.
fr: Retourne la taille des dimensions d'un tableau.

source: The array variable which is being queried.
fr: La variable tableau à examiner.

source: Which dimension of a multi-dimensioned array to report the size of:
fr: Une des dimensions d'un tableau multi-dimensionnel dont il faut trouver la taille:

source: $UBOUND_DIMENSIONS (0) = Number of subscripts in the array
fr: $UBOUND_DIMENSIONS (0) = Nombre de dimensions du tableau

source: $UBOUND_ROWS (1) = Number of rows in the array (default)
fr: $UBOUND_ROWS (1) = Nombre de rangées du tableau (défaut)

source: $UBOUND_COLUMNS (2) = Number of columns in the array
fr: $UBOUND_COLUMNS (2) = Nombre de colonnes du tableau

source: the size of the array dimension.
fr: Retourne la taille d'une dimension du tableau.

source: 1 = Array given is not an array.
fr: 1 = Le paramètre Array n'est pas un tableau.

source: 2 = Array dimension is invalid.
fr: 2 = La dimension du tableau est invalide.

source: Remember that the value returned by UBound() is one greater than the index of an array's last element.
fr: Rappelez-vous que la valeur retournée par UBound() est supérieur de 1 à l'index du dernier élément du tableau.

source: Required for _ArrayDisplay.
fr: Nécessaire pour _ArrayDisplay.

source: Total number of rows.
fr: Nombre total de lignes.

source: In this example it will be 10.
fr: Dans cet exemple, ce sera 10.

source: Total number of columns.
fr: Nombre total de colonnes.

source: In this example it will be 20.
fr: Dans cet exemple, ce sera 20.

source: The dimension of the array e.g.1/2/3 dimensional.
fr: Le nombre de dimensions tableau, ici 2.

source: Fill the array with data.
fr: Remplit le tableau avec les données.

source: port on which the created socket will be bound.
fr: Port sur lequel le socket créé sera connecté.

source: an array :
fr: Retourne un tableau :

source: $aArray[1] contains the real socket, $aArray[2] contains the specified IP address and $aArray[3] contains the port.
fr: $array[1] contient le socket réel, $array[2] contient l'adresse IP spécifiée et $array[3] contient le port.

source: We need this information in subsequent calls to UDPRecv(), where we pass this socket structure/array.
fr: Nous avons besoin de ces informations pour des appels ultérieurs à UDPRecv(), où nous passons cette structure/tableau de socket.

source: Sets the @error flag to non-zero.
fr: Retourne @error <> 0

source: 1 - IPAddr is incorrect.
fr: 1 = 'IPAddr' est incorrect.

source: 2 - port is incorrect.
fr: 2 = 'port' est incorrect.
